using System;
using System.Collections.Generic;
using System.Text;

namespace DotNet.Cryptography
{
    public class RS232
    {
        /// <summary>
        /// 前两位 键值对
        /// </summary>
        public static Dictionary<int, string> d12 = new Dictionary<int, string>()
        {
            {0," "},{1,"-"},{2,"0"},{3,"1"},{4,"2"},{5,"3"},{6,"4"},{7,"5"},{8,"6"},{9,"7"},{10,"8"},{11,"9"},
            {12,"A"},{13,"B"},{14,"C"},{15,"D"},{16,"E"},{17,"F"},{18,"G"},{19,"H"},{20,"I"},{21,"J"},{22,"K"},{23,"L"},
            {24,"M"},{25,"N"},{26,"O"},{27,"P"},{28,"Q"},{29,"R"},{30,"S"},{31,"T"},{32,"U"},{33,"V"},{34,"W"},{35,"X"},
            {36,"Y"},{37,"Z"},{38,"a"},{39,"b"},{40,"c"},{41,"d"},{42,"e"},{43,"f"},{44,"g"},{45,"h"},{46,"i"},{47,"j"},
            {48,"k"},{49,"l"},{50,"m"},{51,"n"},{52,"o"},{53,"p"},{54,"q"},{55,"r"},{56,"s"},{57,"t"},{58,"u"},{59,"v"},
            {60,"w"},{61,"x"},{62,"y"},{63,"z"}
        };

        /// <summary>
        /// 第三位 键值对
        /// </summary>
        public static Dictionary<int, string> d3 = new Dictionary<int, string>()
        {
            {0," "},{1,"A"},{2,"B"},{3,"C"},{4,"D"},{5,"E"},{6,"F"},{7,"G"},{8,"H"},{9,"I"},{10,"J"},{11,"K"},{12,"L"},{13,"M"},{14,"N"},{15,"O"}
        };
    }
}
